src/InformationRegisters/ЖурналОшибокКонтроляОтбора/ЖурналОшибокКонтроляОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОшибокКонтроляОтбора</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Задание</name>
    <type>
      <types>DocumentRef.Задание</types>
    </type>
  </resources>
  <resources>
    <name>Комплектовщик</name>
    <type>
      <types>CatalogRef.Комплектовщики</types>
    </type>
  </resources>
  <resources>
    <name>ВидОшибки</name>
    <type>
      <types>EnumRef.ВидОшибкиКонтроляОтбора</types>
    </type>
  </resources>
  <attributes>
    <name>НомерЗаданияНаОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентфикатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЖурналОшибокКонтроляОтбора/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура записывает информацию об ошибке.
// 
// Параметры:
//  Задание - ДокументСсылка.Задание
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  ВидОшибки - ПеречислениеСсылка.ВидОшибкиКонтроляОтбора
//  НомерЗаданияНаОтбор - Неопределено, Число - Номер строки в табличной части "ЗаданияНаОтбор"
//  ТШК - Неопределено, Строка - ТШК
//  КодМаркировки - Неопределено, Строка - Код маркировки
Процедура ЗаписатьОшибку(Знач Задание,
                         Знач Комплектовщик,
                         Знач ВидОшибки,
                         Знач НомерЗаданияНаОтбор = Неопределено,
                         Знач ТШК = Неопределено,
                         Знач КодМаркировки = Неопределено) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Идентфикатор = Новый УникальныйИдентификатор;

    Запись.Дата = ТекущаяДатаСеанса();
    Запись.Задание = Задание;
    Запись.Комплектовщик = Комплектовщик;
    Запись.ВидОшибки = ВидОшибки;

    Запись.НомерЗаданияНаОтбор = НомерЗаданияНаОтбор;

    Если ТШК <> Неопределено Тогда

        ШтрихкодыКлиентСервер.Сериализовать(ТШК);
        Запись.ТШК = ТШК;

    КонецЕсли;

    Если КодМаркировки <> Неопределено Тогда

        ШтрихкодыКлиентСервер.Сериализовать(КодМаркировки);
        Запись.КодМаркировки = КодМаркировки;

    КонецЕсли;

    Запись.Записать();

КонецПроцедуры

#КонецОбласти
